/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	led.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2016-11-23
	*
	*	版本： 		V1.0
	*
	*	说明： 		LED初始化，亮灭LED
	*
	*	修改记录：	
	************************************************************
	************************************************************
	************************************************************
**/

//单片机头文件
#include "stm32f10x.h"

//LED头文件
#include "led.h"
#include "hwtimer.h"


LED_STATUS led_status;


/*
************************************************************
*	函数名称：	Led_Init
*
*	函数功能：	LED初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		LED4-PC7	LED5-PC8	LED6-PA12	LED7-PC10
				高电平关灯		低电平开灯
************************************************************
*/
void Led_Init(void)
{

	Timer3_4_Init(TIM4, 250, 71);
    
    Led2_Set(0);
    Led3_Set(0);
    Led4_Set(0);
    Led5_Set(0);

}

/*
************************************************************
*	函数名称：	Led2_Set
*
*	函数功能：	LED4控制
*
*	入口参数：	pwmValue：PWM值
*
*	返回参数：	无
*
*	说明：		
************************************************************
*/
void Led2_Set(unsigned char pwmValue)
{

	TIM_SetCompare1(TIM4, pwmValue);
	led_status.Led2Sta = pwmValue;

}

/*
************************************************************
*	函数名称：	Led3_Set
*
*	函数功能：	LED5控制
*
*	入口参数：	pwmValue：PWM值
*
*	返回参数：	无
*
*	说明：		
************************************************************
*/
void Led3_Set(unsigned char pwmValue)
{

	TIM_SetCompare2(TIM4, pwmValue);
	led_status.Led3Sta = pwmValue;

}

/*
************************************************************
*	函数名称：	Led4_Set
*
*	函数功能：	LED6控制
*
*	入口参数：	pwmValue：PWM值
*
*	返回参数：	无
*
*	说明：		
************************************************************
*/
void Led4_Set(unsigned char pwmValue)
{

	TIM_SetCompare3(TIM4, pwmValue);
	led_status.Led4Sta = pwmValue;

}

/*
************************************************************
*	函数名称：	Led5_Set
*
*	函数功能：	LED7控制
*
*	入口参数：	pwmValue：PWM值
*
*	返回参数：	无
*
*	说明：		
************************************************************
*/
void Led5_Set(unsigned char pwmValue)
{

	TIM_SetCompare4(TIM4, pwmValue);
	led_status.Led5Sta = pwmValue;

}
