/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	main.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2017-01-09
	*
	*	版本： 		V1.0
	*
	*	说明： 		GPIO初始化，点亮LED
	*
	*	修改记录：	
	************************************************************
	************************************************************
	************************************************************
**/

//单片机头文件
#include "stm32f10x.h"

//硬件驱动
#include "delay.h"
#include "led.h"


/*
************************************************************
*	函数名称：	Hardware_Init
*
*	函数功能：	硬件初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		初始化单片机功能以及外接设备
************************************************************
*/
void Hardware_Init(void)
{
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);		//中断控制器分组设置

	Delay_Init();										//Systick初始化，用于普通的延时
	
	Led_Init();											//LED接口初始化

}

/*
************************************************************
*	函数名称：	main
*
*	函数功能：	LED流水灯
*
*	入口参数：	无
*
*	返回参数：	0
*
*	说明：		
************************************************************
*/
int main(void)
{

	Hardware_Init();											//硬件初始化
	
	while(1)
	{
	
		Led2_Set(LED_ON);DelayXms(500);Led2_Set(LED_OFF);		//点亮LED4，并延时500ms，然后熄灭LED4
		
		Led3_Set(LED_ON);DelayXms(500);Led3_Set(LED_OFF);		//点亮LED5，并延时500ms，然后熄灭LED5
		
		Led4_Set(LED_ON);DelayXms(500);Led4_Set(LED_OFF);		//点亮LED6，并延时500ms，然后熄灭LED6
		
		Led5_Set(LED_ON);DelayXms(500);Led5_Set(LED_OFF);		//点亮LED7，并延时500ms，然后熄灭LED7
	
	}

}
