/****************************************Copyright (c)*************************
**                               鐗堟潈鎵?鏈? (C), 2015-2020, 娑傞甫绉戞妧
**
**                                 http://www.tuya.com
**
**--------------鏂囦欢淇℃伅-------------------------------------------------------
**鏂?   浠?   鍚?: protocol.h
**鎻?        杩?: 涓嬪彂/涓婃姤鏁版嵁澶勭悊鍑芥暟
**浣? 鐢? 璇? 鏄? :

                  *******闈炲父閲嶈锛屼竴瀹氳鐪嬪摝锛侊紒锛?********

** 1銆佺敤鎴峰湪姝ゆ枃浠朵腑瀹炵幇鏁版嵁涓嬪彂/涓婃姤鍔熻兘
** 2銆丏P鐨処D/TYPE鍙婃暟鎹鐞嗗嚱鏁伴兘闇?瑕佺敤鎴锋寜鐓у疄闄呭畾涔夊疄鐜?
** 3銆佸綋寮?濮嬫煇浜涘畯瀹氫箟鍚庨渶瑕佺敤鎴峰疄鐜颁唬鐮佺殑鍑芥暟鍐呴儴鏈?#err鎻愮ず,瀹屾垚鍑芥暟鍚庤鍒犻櫎璇?#err
**
**--------------褰撳墠鐗堟湰淇---------------------------------------------------
** 鐗?  鏈?: v1.0.2
** 鏃ャ??鏈?: 2018骞?12鏈?6鏃?
** 鎻忋??杩?: 1:澧炲姞浣庡姛鑰楅棬閿乤pi鎺ュ彛鏂囦欢
           2:淇敼澧炲姞閮ㄥ垎鏂板姛鑳藉吋瀹?
		   
** 鐗?  鏈?: v1.0.1
** 鏃ャ??鏈?: 2018骞?11鏈?1鏃?
** 鎻忋??杩?: 1:浣庡姛鑰桽DK涓婄嚎姝ｅ紡鐗?

** 鐗?  鏈?: v1.0
** 鏃ャ??鏈?: 2018骞?4鏈?24鏃?
** 鎻忋??杩?: 1:浣庡姛鑰桽DK棣栫増锛岄?傞厤1.0.2鍗忚
**
**-----------------------------------------------------------------------------
******************************************************************************/
#ifndef __PROTOCOL_H_
#define __PROTOCOL_H_



/******************************************************************************
                            鐢ㄦ埛鐩稿叧淇℃伅閰嶇疆
******************************************************************************/

/******************************************************************************
                          閰嶇疆鏄惁鏀寔閿佸浐浠跺紑鍙?                  
濡傞渶瑕佹敮鎸丮CU浠攣绫诲紑鍙?,璇峰紑鍚瀹?
MCU鍙皟鐢╨ock_api.c鏂囦欢鍐呯殑浠攣绫讳笓鐢ㄦ帴鍙ｅ疄鐜扮浉鍏冲姛鑳?
                        ********WARNING!!!**********
闂ㄩ攣绫诲紑鍙戦粯璁ゆ敮鎸佸浐浠跺崌绾?,鍥轰欢鍗囩骇鍖呬负256瀛楄妭
濡傞渶瑕佸紑鍚鍔熻兘,涓插彛鎺ユ敹缂撳啿鍖轰細鍙樺ぇ
******************************************************************************/
#define         LOCK_API_ENABLE                         //寮?鍚痩ock_api鎺ュ彛
#ifdef LOCK_API_ENABLE
#define         SUPPORT_MCU_FIRM_UPDATE                 //寮?鍚疢CU鍥轰欢鍗囩骇鍔熻兘(閿佺被寮?鍙戯紝榛樿鏀寔)
#endif

/******************************************************************************
                            1:淇敼浜у搧淇℃伅                
******************************************************************************/
#define PRODUCT_KEY "b7do7sirjb0bfka0"    //开发平台创建产品后生成的16位字符产品唯一标识


#define MCU_VER "1.0.0"                                 //鐢ㄦ埛鐨勮蒋浠剁増鏈?,鐢ㄤ簬MCU鍥轰欢鍗囩骇,MCU鍗囩骇鐗堟湰闇?淇敼
/******************************************************************************
                         2:瀹氫箟鏀跺彂缂撳瓨:
                    濡傚綋鍓嶄娇鐢∕CU鐨凴AM涓嶅,鍙慨鏀逛负24
******************************************************************************/
#ifndef SUPPORT_MCU_FIRM_UPDATE
#define WIFI_UART_QUEUE_LMT             16              //鏁版嵁鎺ユ敹闃熷垪澶у皬,濡侻CU鐨凴AM涓嶅,鍙缉灏?
#define WIFI_UART_RECV_BUF_LMT          24              //鏍规嵁鐢ㄦ埛DP鏁版嵁澶у皬閲忓畾,蹇呴』澶т簬24
#else
#define WIFI_UART_QUEUE_LMT             128              //鏁版嵁鎺ユ敹闃熷垪澶у皬,濡侻CU鐨凴AM涓嶅,鍙缉灏?
#define WIFI_UART_RECV_BUF_LMT          300              //鏍规嵁鐢ㄦ埛DP鏁版嵁澶у皬閲忓畾,蹇呴』澶т簬24
#endif

#define WIFIR_UART_SEND_BUF_LMT         24              //鏍规嵁鐢ㄦ埛DP鏁版嵁澶у皬閲忓畾,蹇呴』澶т簬24

/******************************************************************************
                      3:MCU鏄惁闇?瑕佹敮鎸佹牎鏃跺姛鑳?                     
濡傞渶瑕佽寮?鍚瀹?,骞跺湪Protocol.c鏂囦欢鍐卪cu_write_rtctime瀹炵幇浠ｇ爜
mcu_write_rtctime鍐呴儴鏈?#err鎻愮ず,瀹屾垚鍑芥暟鍚庤鍒犻櫎璇?#err
mcu鍦╳ifi妯″潡姝ｇ‘鑱旂綉鍚庡彲璋冪敤mcu_get_system_time()鍑芥暟鍙戣捣鏍℃椂鍔熻兘
******************************************************************************/
//#define         SUPPORT_MCU_RTC_CHECK                //寮?鍚牎鏃跺姛鑳?

/******************************************************************************
                      4:MCU鏄惁闇?瑕佹敮鎸亀ifi鍔熻兘娴嬭瘯                     
濡傞渶瑕佽寮?鍚瀹?,骞朵笖mcu鍦ㄩ渶瑕亀ifi鍔熻兘娴嬭瘯澶勮皟鐢╩cu_api.c鏂囦欢鍐卪cu_start_wifitest
骞跺湪protocol.c鏂囦欢wifi_test_result鍑芥暟鍐呮煡鐪嬫祴璇曠粨鏋?,
wifi_test_result鍐呴儴鏈?#err鎻愮ず,瀹屾垚鍑芥暟鍚庤鍒犻櫎璇?#err
******************************************************************************/
#define         WIFI_TEST_ENABLE                //寮?鍚疻IFI浜ф祴鍔熻兘

/******************************************************************************
                        1:dp鏁版嵁鐐瑰簭鍒楀彿閲嶆柊瀹氫箟
          **姝や负鑷姩鐢熸垚浠ｇ爜,濡傚湪寮?鍙戝钩鍙版湁鐩稿叧淇敼璇烽噸鏂颁笅杞組CU_SDK**         
******************************************************************************/
//解锁方式(只上报)
//备注:具体的编号与开门方式的对应，可以在多语言中翻译
1=人脸、2=密码、3=卡、4=机械钥匙 
#define DPID_UNLOCK_TYPE 101
//解锁ID(只上报)
//备注:门锁上报远程开门请求，需要硬件主动触发
门锁本地上报远程开门请求时，携带x秒倒计时，只有在x秒内才能做出响应，点击允许，门锁将会解锁。可以x小于等于90
#define DPID_UNLOCK_ID 102
//报警(只上报)
//备注:1=低电、2=电池即将耗尽、3=防撬报警、4=密码盘锁死、5=假锁、6=高温
#define DPID_ALART 103
//远程开门倒计时(只上报)
//备注:
#define DPID_OPEN_DOOR_TIME 104
//电量状态(只上报)
//备注:高、中、低、超低（即将关机）
#define DPID_BATTERY 105



/*****************************************************************************
鍑芥暟鍚嶇О : all_data_update
鍔熻兘鎻忚堪 : 绯荤粺鎵?鏈塪p鐐逛俊鎭笂浼?
杈撳叆鍙傛暟 : 鏃?
杩斿洖鍙傛暟 : 鏃?
浣跨敤璇存槑 : MCU蹇呴』瀹炵幇璇ュ嚱鏁板唴鏁版嵁涓婃姤鍔熻兘
*****************************************************************************/
void all_data_update(void);

/*****************************************************************************
鍑芥暟鍚嶇О : dp_record_combine_update
鍔熻兘鎻忚堪 : 璁板綍鍨嬫暟鎹粍鍚堜笂鎶?
杈撳叆鍙傛暟 : time     : 鏃堕棿鏁版嵁鏁?,棣栧瓧鑺傝〃绀烘槸鍚︿紶杈撴爣蹇椾綅锛屽叾浣欎緷娆′负骞淬?佹湀銆佹棩銆佹椂銆佸垎銆佺
           dp_bool  : bool鍨媎pid鍙?, v_bool:瀵瑰簲鍊?
           dp_enum  : enum鍨媎pid鍙?, v_enum:瀵瑰簲鍊?
           dp_value : value鍨媎pid鍙?, v_value:瀵瑰簲鍊?
           dp_string: string鍨媎pid鍙?, v_string:瀵瑰簲鍊?,len:string闀垮害
杩斿洖鍙傛暟 : 鏃?
*****************************************************************************/
unsigned char dp_record_combine_update(unsigned char time[],
                                       unsigned char dp_bool,unsigned char v_bool,
                                       unsigned char dp_enum,unsigned char v_enum,
                                       unsigned char dp_value,unsigned char v_value,
                                       unsigned char dp_string,unsigned char v_string[],unsigned char len);

#ifdef SUPPORT_MCU_RTC_CHECK
/*****************************************************************************
鍑芥暟鍚嶇О : mcu_write_rtctime
鍔熻兘鎻忚堪 : MCU鏍″鏈湴RTC鏃堕挓
杈撳叆鍙傛暟 : 鏃?
杩斿洖鍙傛暟 : 鏃?
浣跨敤璇存槑 : MCU闇?瑕佽嚜琛屽疄鐜拌鍔熻兘
*****************************************************************************/
void mcu_write_rtctime(unsigned char time[]);
#endif

#ifdef WIFI_TEST_ENABLE
/*****************************************************************************
鍑芥暟鍚嶇О : wifi_test_result
鍔熻兘鎻忚堪 : wifi鍔熻兘娴嬭瘯鍙嶉
杈撳叆鍙傛暟 : result:wifi鍔熻兘娴嬭瘯缁撴灉;0:澶辫触/1:鎴愬姛
           rssi:娴嬭瘯鎴愬姛琛ㄧずwifi淇″彿寮哄害/娴嬭瘯澶辫触琛ㄧず閿欒绫诲瀷
杩斿洖鍙傛暟 : 鏃?
浣跨敤璇存槑 : MCU闇?瑕佽嚜琛屽疄鐜拌鍔熻兘
*****************************************************************************/
void wifi_test_result(unsigned char result,unsigned char rssi);
#endif

/*****************************************************************************
鍑芥暟鍚嶇О : wifi_update_handle
鍔熻兘鎻忚堪 : MCU璇锋眰mcu鍥轰欢鍗囩骇杩斿洖鍑芥暟
杈撳叆鍙傛暟 : status:鏍￠獙鏍囧織
杩斿洖鍙傛暟 : 鏃?
浣跨敤璇存槑 : MCU涓诲姩璋冪敤 wifi_update_request 鍑芥暟瀹屾垚鍚庤鍑芥暟鍐呭彲鑾峰彇鍗囩骇褰撳墠鐘舵??
*****************************************************************************/
void wifi_update_handle(unsigned char status);

#ifdef SUPPORT_MCU_FIRM_UPDATE
/*****************************************************************************
鍑芥暟鍚嶇О : mcu_firm_update_handle
鍔熻兘鎻忚堪 : MCU杩涘叆鍥轰欢鍗囩骇妯″紡
杈撳叆鍙傛暟 : value:鍥轰欢缂撳啿鍖?
           position:褰撳墠鏁版嵁鍖呭湪浜庡浐浠朵綅缃?
           length:褰撳墠鍥轰欢鍖呴暱搴?(鍥轰欢鍖呴暱搴︿负0鏃?,琛ㄧず鍥轰欢鍖呭彂閫佸畬鎴?)
杩斿洖鍙傛暟 : 鏃?
浣跨敤璇存槑 : MCU闇?瑕佽嚜琛屽疄鐜拌鍔熻兘
*****************************************************************************/
unsigned char mcu_firm_update_handle(const unsigned char value[],unsigned long position,unsigned short length);
#endif

/*****************************************************************************
鍑芥暟鍚嶇О : dp_download_handle
鍔熻兘鎻忚堪 : dp涓嬪彂澶勭悊鍑芥暟
杈撳叆鍙傛暟 : dpid:DP搴忓彿
value:dp鏁版嵁缂撳啿鍖哄湴鍧?
length:dp鏁版嵁闀垮害
杩斿洖鍙傛暟 : 鎴愬姛杩斿洖:SUCCESS/澶辫触杩斿洖:ERRO
浣跨敤璇存槑 : 璇ュ嚱鏁扮敤鎴蜂笉鑳戒慨鏀?
*****************************************************************************/
unsigned char dp_download_handle(unsigned char dpid,const unsigned char value[], unsigned short length);
/*****************************************************************************
鍑芥暟鍚嶇О : get_download_cmd_total
鍔熻兘鎻忚堪 : 鑾峰彇鎵?鏈塪p鍛戒护鎬诲拰
杈撳叆鍙傛暟 : 鏃?
杩斿洖鍙傛暟 : 涓嬪彂鍛戒护鎬诲拰
浣跨敤璇存槑 : 璇ュ嚱鏁扮敤鎴蜂笉鑳戒慨鏀?
*****************************************************************************/
unsigned char get_download_cmd_total(void);

#endif

