/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	main.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2017-01-09
	*
	*	版本： 		V1.0
	*
	*	说明： 		AT24C02读写
	*
	*	修改记录：	
	************************************************************
	************************************************************
	************************************************************
**/

//单片机头文件
#include "stm32f10x.h"

//硬件驱动
#include "delay.h"
#include "usart.h"
#include "i2c.h"
#include "at24c02.h"



/*
************************************************************
*	函数名称：	Hardware_Init
*
*	函数功能：	硬件初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		初始化单片机功能以及外接设备
************************************************************
*/
void Hardware_Init(void)
{
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);		//中断控制器分组设置

	Delay_Init();										//Systick初始化，用于普通的延时
	
	Usart1_Init(115200);								//初始化usart1，波特率115200
	
	IIC_Init();											//I2C总线初始化
	
	UsartPrintf(USART1, "\r\n麒麟座开发板-V2.2\r\n");	//打印
	UsartPrintf(USART1, "欢迎登陆中移物联官方网站：open.iot.10086.cn\r\n");

}

/*
************************************************************
*	函数名称：	main
*
*	函数功能：	写一个数到EEPROM，然后再读出来
*
*	入口参数：	无
*
*	返回参数：	0
*
*	说明：		
************************************************************
*/
int main(void)
{
	
	unsigned char writeByte = 0, readByte = 0;

	Hardware_Init();									//硬件初始化
	
	while(1)
	{
		
		AT24C02_WriteByte(0x00, writeByte++);
		DelayXms(10);
		AT24C02_ReadByte(0x00, &readByte);
		
		UsartPrintf(USART1, "Read Byte: %d\r\n", readByte);
		
		DelayMs(1000);
	
	}

}
